In [1]:
# Handling missing data
import pandas as pd
import numpy as np

In [2]:
# pandas exclude missing data by default while doing calculation
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
# filtering using boolean masking
string_data[string_data.isnull()]

2    NaN
dtype: object

In [6]:
from numpy import nan as NA

In [7]:
# filtering out the missing data
data = pd.Series([1, NA, 3.5, NA, 7])

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [10]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna(axis=0) 
# drop rows with all NAN

     0    1    2
0  1.0  6.5  3.0

In [12]:
# drop a column with all NAN
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [13]:
df = pd.DataFrame(np.random.randn(7, 3))

In [14]:
df

          0         1         2
0  0.337024  0.558759 -0.930200
1  0.987139  0.170158  0.773413
2 -0.982518  0.877095 -0.605431
3 -1.161100  0.001059  0.829841
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [15]:
df.iloc[:4,1] = NA 
df.iloc[:2,2] = NA

In [16]:
df

          0         1         2
0  0.337024       NaN       NaN
1  0.987139       NaN       NaN
2 -0.982518       NaN -0.605431
3 -1.161100       NaN  0.829841
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [17]:
df.dropna() 
# implicitly axis 0

          0         1         2
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [18]:
df.dropna(axis=0)

          0         1         2
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [19]:
df.dropna(axis=1)

          0
0  0.337024
1  0.987139
2 -0.982518
3 -1.161100
4  0.499537
5 -1.003506
6  1.777542

In [20]:
df.dropna(axis=0,thresh=2) 
# drop rows where NAN>=2

          0         1         2
2 -0.982518       NaN -0.605431
3 -1.161100       NaN  0.829841
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [21]:
# Filling out missing values

In [22]:
df

          0         1         2
0  0.337024       NaN       NaN
1  0.987139       NaN       NaN
2 -0.982518       NaN -0.605431
3 -1.161100       NaN  0.829841
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [23]:
df.fillna(0)

          0         1         2
0  0.337024  0.000000  0.000000
1  0.987139  0.000000  0.000000
2 -0.982518  0.000000 -0.605431
3 -1.161100  0.000000  0.829841
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [24]:
# filling out diff values for each cols
df.fillna({1:0.5,2:0})

          0         1         2
0  0.337024  0.500000  0.000000
1  0.987139  0.500000  0.000000
2 -0.982518  0.500000 -0.605431
3 -1.161100  0.500000  0.829841
4  0.499537 -0.316968 -0.295508
5 -1.003506 -0.854079  0.047376
6  1.777542  0.194362 -0.536364

In [25]:
# DATA TRANSFORMATION

In [26]:
# Removing duplicates

In [27]:
# removing duplicate rows
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [28]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [29]:
# finding out duplication
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

Data Transformation

In [30]:
# Removing duplicates

In [31]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
'k2': [1, 1, 2, 3, 3, 4, 4]})

In [32]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [33]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [34]:
# notice rrow 5,6 have same values

In [35]:
# you can use drop duplicates

In [36]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [37]:
# by default they consider all columns

In [38]:
data['v1'] =  range(7)

In [39]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [40]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [41]:
# now it is all false

In [42]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [43]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [44]:
# by default they keep the first observed value combination

In [45]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [46]:
# you can drop the last too
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [47]:
# Transforming Data using a Function or Mapping

In [48]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
'Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [49]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [50]:
# suppose I want a column where food source maps to each animal

In [51]:
# lets define the mapping first

In [52]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [53]:
# just a bit preprocessing
lowercased = data['food'].str.lower()

In [54]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [55]:
data['animal'] = lowercased.map(meat_to_animal)
# meat-to-animal
# key: meat , value: animal

In [56]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [57]:
# MAPS transform a series containing KEYS to values

In [58]:
# you can use lambda function to do that

In [59]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [60]:
# Replacing Values

In [61]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [62]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [63]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [64]:
# Renaming Axis Indexes

In [65]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [66]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [67]:
data.index.map(lambda x: x[:4].upper())

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [68]:
# Discretization and Binning

In [69]:
# it is very useful to make bins of cont. data

In [70]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [71]:
# lets define our bins first
bins = [18,25,35,60,100]

In [72]:
cats = pd.cut(ages,bins)

In [80]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [74]:
# this cats is a pandas categorical type

In [84]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [85]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [87]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [89]:
# you can select how the cuts will be made
pd.cut(ages,[18, 26, 36, 61, 100],right=True)

[(18, 26], (18, 26], (18, 26], (26, 36], (18, 26], ..., (26, 36], (36, 61], (36, 61], (36, 61], (26, 36]]
Length: 12
Categories (4, interval[int64, right]): [(18, 26] < (26, 36] < (36, 61] < (61, 100]]

In [90]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [91]:
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [92]:
data = np.random.rand(20)

In [93]:
pd.cut(data,4,precision=2)

[(0.48, 0.7], (0.044, 0.26], (0.044, 0.26], (0.7, 0.92], (0.26, 0.48], ..., (0.26, 0.48], (0.48, 0.7], (0.26, 0.48], (0.7, 0.92], (0.7, 0.92]]
Length: 20
Categories (4, interval[float64, right]): [(0.044, 0.26] < (0.26, 0.48] < (0.48, 0.7] < (0.7, 0.92]]

In [94]:
# qcut bins the data based on sample quantiles

In [95]:
data = np.random.randn(1000)

In [99]:
cats = pd.qcut(data,6)

In [100]:
cats

[(-0.95, -0.453], (0.429, 0.916], (0.429, 0.916], (0.429, 0.916], (-3.179, -0.95], ..., (-0.95, -0.453], (0.429, 0.916], (-0.453, -0.0275], (-0.0275, 0.429], (-0.95, -0.453]]
Length: 1000
Categories (6, interval[float64, right]): [(-3.179, -0.95] < (-0.95, -0.453] < (-0.453, -0.0275] < (-0.0275, 0.429] < (0.429, 0.916] < (0.916, 2.843]]

In [98]:
cats.value_counts()

(-3.179, -0.669]     250
(-0.669, -0.0275]    250
(-0.0275, 0.658]     250
(0.658, 2.843]       250
dtype: int64

In [101]:
# Detecting and Filtering Outliers

In [102]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [103]:
data

            0         1         2         3
0    1.290881 -1.617023  0.741881 -1.994396
1   -1.622647  1.862755 -1.601164  0.479891
2   -0.506392  0.014035 -0.168868  0.667691
3    0.886807 -0.053400  0.560719  1.037831
4    0.032810  0.945482  0.375885 -0.934743
..        ...       ...       ...       ...
995 -0.048616  0.703072 -0.373533 -0.280713
996  0.035069  0.455176  2.051814 -0.858068
997 -0.235334 -0.661223 -1.123752 -0.256269
998 -0.598511 -0.391543 -1.962374  0.926937
999  0.156467 -1.269401 -0.332337 -2.014418

[1000 rows x 4 columns]

In [104]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.013792    -0.059841     0.031623    -0.021552
std       0.981494     1.015495     0.972047     1.025111
min      -2.850646    -3.314737    -3.509353    -3.019487
25%      -0.639135    -0.730723    -0.629196    -0.728184
50%      -0.036002    -0.051090     0.024732    -0.045796
75%       0.627070     0.608058     0.680480     0.741587
max       3.102450     3.250284     2.934290     3.243298

In [105]:
# suppose you wanted to find values in one of the cols exceeding 3 in absolute value
col = data[2]

In [106]:
col

0      0.741881
1     -1.601164
2     -0.168868
3      0.560719
4      0.375885
         ...
995   -0.373533
996    2.051814
997   -1.123752
998   -1.962374
999   -0.332337
Name: 2, Length: 1000, dtype: float64

In [107]:
np.abs(col)>3

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: 2, Length: 1000, dtype: bool

In [108]:
col[np.abs(col)>3]

91    -3.509353
292   -3.043121
Name: 2, dtype: float64

In [110]:
# to select all rows having a value exceeding 3 or -3, you can use the any method on a 
# boolean DF

In [111]:
np.abs(data)>3

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [113]:
data[(np.abs(data)>3).any(1)] 
# here 1 refers to the axis

            0         1         2         3
64   3.102450 -0.424854  0.650911 -0.590694
91  -1.469242 -0.528626 -3.509353 -1.860333
292 -0.349076  0.514764 -3.043121 -1.030253
683 -0.935279  3.250284  0.656516  1.465267
770 -0.906394  0.215837  0.827321  3.243298
892 -0.019129 -3.314737  0.305768 -1.237927
910 -0.844480  0.940647 -0.271787 -3.019487
977 -0.153520  3.015683 -0.074669  0.107780

In [114]:
# we can fill those absolute 
data[np.abs(data)>3] = np.sign(data) * 3

In [115]:
data[np.abs(data)>3]

      0   1   2   3
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN
3   NaN NaN NaN NaN
4   NaN NaN NaN NaN
..   ..  ..  ..  ..
995 NaN NaN NaN NaN
996 NaN NaN NaN NaN
997 NaN NaN NaN NaN
998 NaN NaN NaN NaN
999 NaN NaN NaN NaN

[1000 rows x 4 columns]

In [116]:
# permutation and Random Sampling

In [117]:
# numpy.random.permutation

In [118]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [119]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [120]:
# lets create a sampler
sampler = np.random.permutation(5)

In [123]:
sampler

array([2, 4, 0, 3, 1])

In [122]:
type(sampler)

numpy.ndarray

In [121]:
df.take(sampler) 
# by default its axis 0

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15
1   4   5   6   7

In [124]:
# lets take a random subset without replacement
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11

In [125]:
# to generate sample with replacement use choices
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [128]:
df.iloc[sampler] 
# axis 0

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15
1   4   5   6   7

In [129]:
choices = pd.Series([5, 7, -1, 6, 4])

In [130]:
draws = choices.sample(n=10,replace=True)

In [131]:
draws

3    6
1    7
4    4
1    7
4    4
4    4
2   -1
3    6
1    7
2   -1
dtype: int64

In [132]:
# Computing Indicator/Dummy Variables

In [133]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
'data1': range(6)})

In [134]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

Another type of transformation for statistical modeling or machine learning applica‐
tions is converting a categorical variable into a “dummy” or “indicator” matrix. If a
column in a DataFrame has k distinct values, you would derive a matrix or Data‐
Frame with k columns containing all 1s and 0s.

In [135]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [136]:
dummies = pd.get_dummies(df['key'],prefix='key')

In [137]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [139]:
df_with_dummy = df[['data1']].join(dummies)

In [140]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [141]:
df['data1']

0    0
1    1
2    2
3    3
4    4
5    5
Name: data1, dtype: int64

In [142]:
df[['data1']]

   data1
0      0
1      1
2      2
3      3
4      4
5      5

In [143]:
mnames = ['movie_id', 'title', 'genres']

In [144]:
movies = pd.read_table('Data/movies.dat',sep='::',header=None,names=mnames)

/tmp/ipykernel_3420/2345179199.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('Data/movies.dat',sep='::',header=None,names=mnames)

In [145]:
movies

,movie_id,title,genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [146]:
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy